[
    {
        "plateform": "tryhackme",
        "machine": "Mr. Robot",
        "description": "TryHackMe: Mr. Robot walkthrough",
        "url":"https://zeronumeric.medium.com/mr-robot-tryhackmectf-522584cf69f7"
    },
    {
        "plateform": "miscellenaous",
        "machine": "-",
        "description": "I got a telegram message for a friendship and to share some experiences of life. Her first topic of conversation is cryptocurrency. Cheesy right? At first, I thought to say no but my cyber instinct say that it is a learning opportunity and it was. I thought she is a junior phisher. The detailed method of this scam is mentioned below with some tips and tricks you have to follow when you see around yourself or with your family member to stay safe from a scammer. The story has some phases with screenshots of our conversions.",
        "url":"https://zeronumeric.medium.com/trainee-scammer-101-347e6f86d215"
    },
    {
        "plateform": "ceh",
        "machine": "-",
        "description": "CEH Certificate experience, tips and tricks",
        "url":"https://zeronumeric.medium.com/ceh-practical-exam-experience-and-tips-d8f944f96b38"
    },
    {
        "plateform": "hackthebox",
        "machine": "Bizness",
        "description": "The ofbiz framework is vulnerable to cve-2023-49070, leading to Remote Code Execution (RCE). This vulnerability grants unauthorized user access, eventually revealing the root password stored in a file in base64 url-safe encoded form. Once decoded, a weakly encrypted sha1 hash is exposed, which can be cracked using hashcat to obtain the root password",
        "url":"https://github.com/het-desai/hackthebox/tree/main/bizness/write-up.md"
    },
    {
        "plateform": "-",
        "machine": "-",
        "description": "Python cheatsheet",
        "url":"https://xmind.ai/share/4WRGg1ds?xid=bHt93b7c"
    },
    {
        "plateform": "-",
        "machine": "-",
        "description": "Debian linux cheatsheet",
        "url":"https://xmind.ai/share/JEYJmftl?xid=aMYhUbZ6"
    },
    {
        "plateform": "-",
        "machine": "-",
        "description": "Bash Scripting cheatsheet",
        "url":"https://xmind.ai/share/2VOpyU3T?xid=tL8xXVig"
    },
    {
        "plateform": "hackthebox",
        "machine": "Devvortex",
        "description": "The nmap found open ports 22 and 80. DNS brute force uncovered a subdomain using gobuster for file discovery. Exploiting a Joombla CMS vulnerability (CVE-2023-23752) granted access to the Administrator page, enabling unauthorized content exploitation and data entry. After login, a web shell was established, mysql database accessed, and a user's password hash cracked with JohnTheRipper. Root access was achieved through sudo-accessible root programs, leading to privilege escalation via apport-cli.",
        "url":"https://github.com/het-desai/hackthebox/tree/main/devvortex/write-up.md"
    },
    {
        "plateform": "hackthebox",
        "machine": "Codify",
        "description": "The exploration of the Codify machine, a comprehensive Nmap scan unraveled the intricacies of its technological landscape, revealing open ports 22, 80, 3000, and 8000. Our attention shifted to the web applications on ports 80 and 3000, particularly focusing on the captivating codify.htb. Unveiling a critical Node.js vulnerability (CVE-2023-30547) associated with the vm2 library, we crafted a proof-of-concept (PoC) payload, securing a web shell and initiating user-level access. Delving into a web application at /var/www/contact, we deciphered a login mechanism, cracked a user's password, and ascended to root through a sudo-accessible script—culminating in a detailed technical exploration on Codify.",
        "url":"https://github.com/het-desai/hackthebox/tree/main/codify/write-up.md"
    },
    {
        "plateform": "hackthebox",
        "machine": "Cozyhosting",
        "description": "The initial scan using Nmap reveals open ports, including SSH and an nginx server hosting a web app built with the SpringBoot framework. The walkthrough focuses on exploring this web application, using tools like Ffuf to discover valuable endpoints such as '/actuator/sessions'. This reveals an exploitable session ID vulnerability, allowing the attacker to manipulate cookies creatively and gain access to an admin page, establishing a foothold. The write-up covers two lateral movement methods, specifically the extraction of a jar file. Within these files discovers the username and password for a Postgres database, providing further access. Following the escalation path, the guide demonstrates the cracking of the admin user's password hash, granting access to the josh user. Privilege escalation then reveals superuser permissions for the SSH command, ultimately achieving a root shell using a clever technique documented in GTFOBins.",
        "url":"https://github.com/het-desai/hackthebox/tree/main/cozyhosting/write-up.md"
    }
]