[
    {
        "plateform": "Blog",
        "machine": "Mr. Robot",
        "description": "TryHackMe: Mr. Robot walkthrough",
        "url":"https://zeronumeric.medium.com/mr-robot-tryhackmectf-522584cf69f7"
    },
    {
        "plateform": "Blog",
        "machine": "",
        "description": "I got a telegram message for a friendship and to share some experiences of life. Her first topic of conversation is cryptocurrency. Cheesy right? At first, I thought to say no but my cyber instinct say that it is a learning opportunity and it was. I thought she is a junior phisher. The detailed method of this scam is mentioned below with some tips and tricks you have to follow when you see around yourself or with your family member to stay safe from a scammer. The story has some phases with screenshots of our conversions.",
        "url":"https://zeronumeric.medium.com/trainee-scammer-101-347e6f86d215"
    },
    {
        "plateform": "Certificate",
        "machine": "",
        "description": "CEH Certificate experience, tips and tricks",
        "url":"https://zeronumeric.medium.com/ceh-practical-exam-experience-and-tips-d8f944f96b38"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Bizness",
        "description": "The ofbiz framework is vulnerable to cve-2023-49070, leading to Remote Code Execution (RCE). This vulnerability grants unauthorized user access, eventually revealing the root password stored in a file in base64 url-safe encoded form. Once decoded, a weakly encrypted sha1 hash is exposed, which can be cracked using hashcat to obtain the root password",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/bizness/write-up.md"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Python cheat sheet",
        "url":"https://xmind.ai/share/4WRGg1ds"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Debian linux cheat sheet",
        "url":"https://xmind.ai/share/JEYJmftl"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Bash Scripting cheat sheet",
        "url":"https://xmind.ai/share/2VOpyU3T"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Devvortex",
        "description": "The nmap found open ports 22 and 80. DNS brute force uncovered a subdomain using gobuster for file discovery. Exploiting a Joombla CMS vulnerability (CVE-2023-23752) granted access to the Administrator page, enabling unauthorized content exploitation and data entry. After login, a web shell was established, mysql database accessed, and a user's password hash cracked with JohnTheRipper. Root access was achieved through sudo-accessible root programs, leading to privilege escalation via apport-cli.",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/devvortex/write-up.md"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Codify",
        "description": "The exploration of the Codify machine, a comprehensive Nmap scan unraveled the intricacies of its technological landscape, revealing open ports 22, 80, 3000, and 8000. Our attention shifted to the web applications on ports 80 and 3000, particularly focusing on the captivating codify.htb. Unveiling a critical Node.js vulnerability (CVE-2023-30547) associated with the vm2 library, we crafted a proof-of-concept (PoC) payload, securing a web shell and initiating user-level access. Delving into a web application at /var/www/contact, we deciphered a login mechanism, cracked a user's password, and ascended to root through a sudo-accessible script—culminating in a detailed technical exploration on Codify.",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/codify/write-up.md"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Cozyhosting",
        "description": "The initial scan using Nmap reveals open ports, including SSH and an nginx server hosting a web app built with the SpringBoot framework. The walkthrough focuses on exploring this web application, using tools like Ffuf to discover valuable endpoints such as '/actuator/sessions'. This reveals an exploitable session ID vulnerability, allowing the attacker to manipulate cookies creatively and gain access to an admin page, establishing a foothold. The write-up covers two lateral movement methods, specifically the extraction of a jar file. Within these files discovers the username and password for a Postgres database, providing further access. Following the escalation path, the guide demonstrates the cracking of the admin user's password hash, granting access to the josh user. Privilege escalation then reveals superuser permissions for the SSH command, ultimately achieving a root shell using a clever technique documented in GTFOBins.",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/cozyhosting/write-up.md"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Escape",
        "description": "Compromised MSSQL via weak credentials and NetNTLM hash capture through Responder. Escalated to domain admin by exploiting AD CS ESC1 misconfigurations using Certipy to request and authenticate with a forged administrator certificate.",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/escape/write-up.md"
    },
    {
        "plateform": "HackTheBox",
        "machine": "EscapeTwo",
        "description": "This assessment focuses on the enumeration of an Active Directory–based target on the Hack The Box network, using tools such as Nmap, smbmap, smbclient, CrackMapExec, and Impacket to identify exposed services and misconfigurations. Detailed inspection of SMB shares led to the extraction and recovery of corrupted XLSX files containing valid domain credentials. These findings provided a clear foothold for deeper access and set the stage for further exploitation and privilege escalation. The exercise highlights how thorough enumeration and careful artifact analysis can uncover weak credential practices and indirect attack paths in AD environments.",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/escapetwo/write-up.md"
    },
    {
        "plateform": "HackTheBox",
        "machine": "Active",
        "description": "The Nmap scan reveals typical Active Directory ports, including SMB, Kerberos, and LDAP. SMB enumeration leads to the discovery of user accounts, and access to the Replication share reveals a Group Policy Preference (GPP) XML file containing a cpassword. Decrypting it provides valid user-level credentials. AS-REP Roasting is then performed against another user without Kerberos preauthentication, and the cracked hash yields credentials with administrative privileges",
        "url":"https://raw.githubusercontent.com/het-desai/hackthebox/refs/heads/main/active/write-up.md"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Windows CMD/Powershell cheat sheet",
        "url":"https://xmind.ai/share/HLCwtteP"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "AD PenTesting cheat sheet",
        "url":"https://xmind.ai/share/hN79m4dx"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Wireless PenTesting cheat sheet",
        "url":"https://xmind.ai/share/uNCHVISl"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Cisco Switch Configuration cheat sheet",
        "url":"https://xmind.ai/share/DDs4cfPx"
    },
    {
        "plateform": "Cheat Sheet",
        "machine": "",
        "description": "Docker Terminal and Configuration file's commands cheat sheet",
        "url":"https://xmind.ai/share/nDuamGoo"
    },
    {
        "plateform": "Offsec",
        "machine": "Levram",
        "description": "An Nmap scan revealed open port 8000 hosting a Gerapy web application. Default admin credentials provided access to the panel, where an authenticated RCE exploit (CVE-2021-43857) was leveraged to gain an initial foothold. After stabilizing the shell, local enumeration uncovered two privilege escalation vectors: a python3.10 binary with the cap_setuid=ep capability and a plaintext root password stored in a systemd service file. Exploiting either path granted root privileges and full system compromise on Levram.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Levram/write-up.md"
    },
    {
        "plateform": "Offsec",
        "machine": "Internal",
        "description": "This report documents the successful compromise of a Windows Server 2008 Internal machine from the OffSec Practice lab. The system was vulnerable to the SMBv2 Negotiation Vulnerability (CVE-2009-3103), which allowed unauthenticated remote code execution. Using Metasploit, SYSTEM-level access was achieved, and the proof file was retrieved. The exercise highlights the risks of unpatched legacy SMB services and the importance of timely vulnerability management.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Internal/write-up.md"
    },
    {
        "plateform": "Offsec",
        "machine": "Algernon",
        "description": "This report outlines the compromise of the Algernon machine from the OffSec Practice lab through a structured enumeration and exploitation workflow. A thorough port scan revealed an exposed .NET Remoting service on port 17001, which led to the identification of an unauthenticated SmarterMail RCE vulnerability (CVE-2019-7214). Using a publicly available exploit, SYSTEM‑level access was obtained and the proof file was retrieved. The assessment highlights the value of comprehensive enumeration and targeted vulnerability research when attacking Windows-based systems.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Algernon/write-up.md"
    },
    {
        "plateform": "Offsec",
        "machine": "Access",
        "description": "Windows Active Directory environment, combining web exploitation with AD attacks. Tools such as Nmap, ffuf, Kerbrute, BloodHound, Rubeus, Hashcat, and custom privilege escalation exploits were used to achieve SYSTEM-level access.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Access/write-up.md"
    },
    {
        "plateform": "Offsec",
        "machine": "Heist",
        "description": "Active Directory compromise driven by credential exposure and permission abuse rather than traditional exploits. The attack leveraged tools like BloodHound for AD enumeration, NTLM hash capture and cracking for initial access, abuse of ReadGMSAPassword to obtain gMSA credentials, and SeRestorePrivilege to escalate to SYSTEM. It highlights how chaining common misconfigurations and legitimate Windows features can lead from a low-privileged foothold to complete domain-level compromise.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Heist/write-up.md"
    },
    {
        "plateform": "Offsec",
        "machine": "Nagoya",
        "description": "Active Directory attack chain involving network enumeration, Kerberos attacks, SMB abuse, and privilege escalation. Tools such as Nmap, CrackMapExec, Kerbrute, Impacket, BloodHound, Hashcat, and Evil-WinRM were used to perform techniques including username enumeration, password spraying, Kerberoasting, credential harvesting, and service account abuse. The challenge highlights how small misconfigurations can be chained together to achieve domain-level access.",
        "url":"https://raw.githubusercontent.com/het-desai/Offsec-CTF/refs/heads/main/Practice/Nagoya/write-up.md"
    }
]